#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mdata.aws_iam_role.deployment: Reading...[0m[0m
[0m[1maws_dynamodb_table.terraform_state_lock: Refreshing state... [id=terraform-state][0m
[0m[1maws_s3_bucket.terraform_state: Refreshing state... [id=mati-terraform-state][0m
[0m[1mdata.aws_iam_role.deployment: Read complete after 0s [id=deployment-role][0m
[0m[1maws_s3_bucket_policy.terraform_state: Refreshing state... [id=mati-terraform-state][0m
[0m[1maws_s3_bucket_versioning.terraform_state: Refreshing state... [id=mati-terraform-state][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_organizations_organization.org[0m will be created
[0m  [32m+[0m[0m resource "aws_organizations_organization" "org" {
      [32m+[0m[0m accounts             = (known after apply)
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m feature_set          = "ALL"
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m master_account_arn   = (known after apply)
      [32m+[0m[0m master_account_email = (known after apply)
      [32m+[0m[0m master_account_id    = (known after apply)
      [32m+[0m[0m master_account_name  = (known after apply)
      [32m+[0m[0m non_master_accounts  = (known after apply)
      [32m+[0m[0m roots                = (known after apply)
    }

[1m  # aws_organizations_organizational_unit.preprod[0m will be created
[0m  [32m+[0m[0m resource "aws_organizations_organizational_unit" "preprod" {
      [32m+[0m[0m accounts  = (known after apply)
      [32m+[0m[0m arn       = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m name      = "preprod"
      [32m+[0m[0m parent_id = (known after apply)
      [32m+[0m[0m tags_all  = (known after apply)
    }

[1m  # aws_organizations_organizational_unit.prod[0m will be created
[0m  [32m+[0m[0m resource "aws_organizations_organizational_unit" "prod" {
      [32m+[0m[0m accounts  = (known after apply)
      [32m+[0m[0m arn       = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m name      = "production"
      [32m+[0m[0m parent_id = (known after apply)
      [32m+[0m[0m tags_all  = (known after apply)
    }

[1m  # aws_vpc.main[0m will be created
[0m  [32m+[0m[0m resource "aws_vpc" "main" {
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m cidr_block                           = "11.0.0.0/16"
      [32m+[0m[0m default_network_acl_id               = (known after apply)
      [32m+[0m[0m default_route_table_id               = (known after apply)
      [32m+[0m[0m default_security_group_id            = (known after apply)
      [32m+[0m[0m dhcp_options_id                      = (known after apply)
      [32m+[0m[0m enable_dns_hostnames                 = (known after apply)
      [32m+[0m[0m enable_dns_support                   = true
      [32m+[0m[0m enable_network_address_usage_metrics = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_tenancy                     = "default"
      [32m+[0m[0m ipv6_association_id                  = (known after apply)
      [32m+[0m[0m ipv6_cidr_block                      = (known after apply)
      [32m+[0m[0m ipv6_cidr_block_network_border_group = (known after apply)
      [32m+[0m[0m main_route_table_id                  = (known after apply)
      [32m+[0m[0m owner_id                             = (known after apply)
      [32m+[0m[0m tags_all                             = (known after apply)
    }

[1mPlan:[0m 4 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @alexmxti, Working Directory: `aws-account-management`*